Item/app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", "npetkov@csumb.edu"], ["LIMIT", 1]]
---
  def get
    @id = params[:id]
    @email = params[:email]
    @customer = nil
    if !@id.nil?
      @customer = Customer.find_by(id: @id)
    elsif !@email.nil?
      @customer = Customer.find_by(email: @email)

INSERT INTO "customers" ("email", "lastName", "firstName", "lastOrder", "lastOrder2", "lastOrder3", "award", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    @customer.award = 0
    @customer.lastOrder = 0
    @customer.lastOrder2 = 0
    @customer.lastOrder3 = 0

    if @customer.save

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def processOrder
    @id = params[:customerId]
    @award = params[:award]
    @total = params[:total]
    @customer = Customer.find_by(id: @id)