Item/app/controllers/items_controller.rb

    def get
        @id = params[:id] #collect input
        @item = nil

        #check to make sure the id isn't null
        if !@id.nil?
            @item = Item.find_by(id: @id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        # defined object to receive strict item_params including :description, :price, :stockQty ; else return 400
        @item = Item.new(item_params)

        if @item.save
---
INSERT INTO "items" ("description", "price", "stockQty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Cooler toy 2"], ["price", 2.0], ["stockQty", 2], ["created_at", "2019-07-31 21:55:38.593961"], ["updated_at", "2019-07-31 21:55:38.593961"]]

    def processItemsOrder
        @id = params[:itemID]
        @description = params[:description]
        @price = params[:price]
        @award = params[:award]
        @item = Item.find_by(id: @id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" IS NULL LIMIT ?  [["LIMIT", 1]]